RM2CBEx/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    walls 
    {
        type            noSlip;
    }

    inlet 
    {
        type            fixedValue;
        value           uniform (0 -1 0);
    }

    outlet 
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    volume 
    {
        type            noSlip;
    }
}

// ************************************************************************* //