RM2CBEx/0/epsilon

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.23;

boundaryField
{
    inlet 
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.0168;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;  
    }
    volume 
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    walls 
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
