RM2CBEx/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// this is all copied form pitzDaily tutorial btw (ver openfoam12)
convertToMeters 1;

xmin -0.5;
ymin -0.5;
zmin -0.5;
xmax 7.5;
ymax 9.3;
zmax 3;

deltax 0.1;
deltay 0.1;
deltaz 0.1;

xcells #calc "round($xmax / $deltax)";
ycells #calc "round($ymax / $deltay)";
zcells #calc "round($zmax / $deltaz)";

vertices
(
    ($xmin $ymin $zmin) // 0
    ($xmax $ymin $zmin) // 1
    ($xmax $ymax $zmin) // 2
    ($xmin $ymax $zmin) // 3
    ($xmin $ymin $zmax) // 4
    ($xmax $ymin $zmax) // 5
    ($xmax $ymax $zmax) // 6
    ($xmin $ymax $zmax) // 7
);

edges (

);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
);

boundary
(
    inlet 
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    outlet 
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    walls 
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (4 5 6 7)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(

);


// ************************************************************************* //